import instagramIcon from '../../assets/img/Instagram.svg'
import telegramIcon from '../../assets/img/telegram.svg'

import cat1 from '../../assets/img/cat1.png'
import cat2 from '../../assets/img/cat2.png'
import cat3 from '../../assets/img/cat3.png'
import cat4 from '../../assets/img/cat4.png'
import cat5 from '../../assets/img/cat5.png'
import cat6 from '../../assets/img/cat6.png'
import cat7 from '../../assets/img/cat7.png'
import cat8 from '../../assets/img/cat8.png'

import products1 from '../../assets/img/main1.png'
import products2 from '../../assets/img/main2.png'
import products3 from '../../assets/img/main3.png'
import products4 from '../../assets/img/main4.png'
import products5 from '../../assets/img/main5.png'
import products6 from '../../assets/img/main6.png'
import products7 from '../../assets/img/main7.png'
import products8 from '../../assets/img/main8.png'
import products9 from '../../assets/img/main9.png'
import products10 from '../../assets/img/main10.png'

import checkIconBrown from '../../assets/img/check.png'

import infoIcon from '../../assets/img/info.png'
import userIcon from '../../assets/img/user.png'

import info1 from '../../assets/img/info1.svg'
import info2 from '../../assets/img/info2.svg'
import info3 from '../../assets/img/info3.svg'


import gallery1 from '../../assets/img/gallery1.png'
import gallery2 from '../../assets/img/gallery2.png'



export const headerSocials  = [
  {
    id:1,
    path:'',
    name:'instagram',
    icon:instagramIcon
  },
  {
    id:2,
    path:'',
    name:'telegram',
    icon:telegramIcon
  },
 
]


export const catItems = [
  {
    id:1,
    icon:cat1,
    text:'Все товары'
  },
  {
    id:2,
    icon:cat2,
    text:'Для дома'
  },
  {
    id:3,
    icon:cat3,
    text:'Для мужчин'
  },
  {
    id:4,
    icon:cat4,
    text:'Для женщин'
  },
  {
    id:5,
    icon:cat5,
    text:'Для детей'
  },
  {
    id:6,
    icon:cat6,
    text:'Для здоровья'
  },
  {
    id:7,
    icon:cat7,
    text:'Подарки'
  },
  {
    id:8,
    icon:cat8,
    text:'Гаджеты'
  }
]


export const productsItems = [
  {
    id:1,
    image:products1,
    title:'Многофункциональная терка овощерезка с контейнером',
    text:'Быстрая доставка',
    discount:'-15%'
  },
  {
    id:2,
    image:products2,
    title:'Shock Pad Антивибрационные ножки для стиральной машины',
    text:'Быстрая доставка',
    discount:'-15%'
  },
  {
    id:3,
    image:products3,
    title:'Дозатор Турум бурум для круп 6 в 1 c Доставкой',
    text:'Быстрая доставка',
    discount:""
  },
  {
    id:4,
    image:products4,
    title:'Тренажер для позвоночника Magic Back Support',
    text:'Быстрая доставка',
    discount:""

  },
  {
    id:5,
    image:products5,
    title:'Дозатор Турум бурум для круп 6 в 1 c Доставкой',
    text:'Быстрая доставка',
    discount:""

  },
  {
    id:6,
    image:products6,
    title:'Тренажер для позвоночника Magic Back Support',
    text:'Быстрая доставка',
    discount:""

  },
  {
    id:7,
    image:products7,
    title:'Дозатор Турум бурум для круп 6 в 1 c Доставкой',
    text:'Быстрая доставка',
    discount:""

  },
  {
    id:8,
    image:products8,
    title:'Тренажер для позвоночника Magic Back Support',
    text:'Быстрая доставка',
    discount:""

  },
  {
    id:9,
    image:products9,
    title:'Дозатор Турум бурум для круп 6 в 1 c Доставкой',
    text:'Быстрая доставка',
    discount:""

  },
  {
    id:10,
    image:products10,
    title:'Тренажер для позвоночника Magic Back Support',
    text:'Быстрая доставка',
    discount:""
  },
]

export const productsBannerItems = [
  {
    id:1,
    title:'Развивает творческие качества, фантазию, а также креативность',
    icon:checkIconBrown
  },
  {
    id:2,
    title:'Развивает восприятие цвета, способность воображения',
    icon:checkIconBrown
  },
  {
    id:3,
    title:'Улучшает моторику рук и пальчиков',
    icon:checkIconBrown
  }
]


export const productsServicesItem = [
  {
    id:1,
    title:'Оплата после доставки: Payme, Click и наличными',
    icon:info1
  },
  {
    id:2,
    title:'Быстрая доставка курьером на дом по Узбекистану',
    icon:info2
  },
  {
    id:3,
    title:'В случае заводского брака обменяем товар',
    icon:info3
  }
]

export const infoCouresel = [
  {
    id:1,
    image:gallery1
  },
  {
    id:2,
    image:gallery2
  },
  {
    id:3,
    image:gallery1
  }
]

export const  reviewsData = [
{
  id:1,
  message:'Заказывала впервые на этом сайте. Сказать, что мне понравилось, это ничего не сказать! Упаковка, качество, скорость все на высоте!!! Ещё и подарочек-сюрприз внутри! Спасибо огромное за Вашу работу! Всех благ и процветания Вашему магазину!',
  source:'Заказал(а) через Instagram',
  client_name:' Наргиза Халилова',
  client_avatar:userIcon
},
{
  id:2,
  message:'Заказывала впервые на этом сайте. Сказать, что мне понравилось, это ничего не сказать! Упаковка, качество, скорость все на высоте!!! Ещё и подарочек-сюрприз внутри! Спасибо огромное за Вашу работу! Всех благ и процветания Вашему магазину!',
  source:'Заказал(а) через Instagram',
  client_name:' Наргиза Халилова',
  client_avatar:userIcon
},
{
  id:3,
  message:'Заказывала впервые на этом сайте. Сказать, что мне понравилось, это ничего не сказать! Упаковка, качество, скорость все на высоте!!! Ещё и подарочек-сюрприз внутри! Спасибо огромное за Вашу работу! Всех благ и процветания Вашему магазину!',
  source:'Заказал(а) через Instagram',
  client_name:' Наргиза Халилова',
  client_avatar:userIcon
},
{
  id:4,
  message:'Заказывала впервые на этом сайте. Сказать, что мне понравилось, это ничего не сказать! Упаковка, качество, скорость все на высоте!!! Ещё и подарочек-сюрприз внутри! Спасибо огромное за Вашу работу! Всех благ и процветания Вашему магазину!',
  source:'Заказал(а) через Instagram',
  client_name:' Наргиза Халилова',
  client_avatar:userIcon
},
{
  id:5,
  message:'Заказывала впервые на этом сайте. Сказать, что мне понравилось, это ничего не сказать! Упаковка, качество, скорость все на высоте!!! Ещё и подарочек-сюрприз внутри! Спасибо огромное за Вашу работу! Всех благ и процветания Вашему магазину!',
  source:'Заказал(а) через Instagram',
  client_name:' Наргиза Халилова',
  client_avatar:userIcon
},
{
  id:6,
  message:'Заказывала впервые на этом сайте. Сказать, что мне понравилось, это ничего не сказать! Упаковка, качество, скорость все на высоте!!! Ещё и подарочек-сюрприз внутри! Спасибо огромное за Вашу работу! Всех благ и процветания Вашему магазину!',
  source:'Заказал(а) через Instagram',
  client_name:' Наргиза Халилова',
  client_avatar:userIcon
},
{
  id:7,
  message:'Заказывала впервые на этом сайте. Сказать, что мне понравилось, это ничего не сказать! Упаковка, качество, скорость все на высоте!!! Ещё и подарочек-сюрприз внутри! Спасибо огромное за Вашу работу! Всех благ и процветания Вашему магазину!',
  source:'Заказал(а) через Instagram',
  client_name:' Наргиза Халилова',
  client_avatar:userIcon
},
{
  id:8,
  message:'Заказывала впервые на этом сайте. Сказать, что мне понравилось, это ничего не сказать! Упаковка, качество, скорость все на высоте!!! Ещё и подарочек-сюрприз внутри! Спасибо огромное за Вашу работу! Всех благ и процветания Вашему магазину!',
  source:'Заказал(а) через Instagram',
  client_name:' Наргиза Халилова',
  client_avatar:userIcon
}

]

export const reviewsWidtgetData = [
  {
    id:1,
    precent:'799+',
    text:'Продаж 🛒'
  },
  {
    id:2,
    precent:'231+',
    text:'Отзывов 😍'
  },
  {
    id:3,
    precent:'2835+',
    text:'Лайков ❤️'
  },
  {
    id:4,
    precent:'100%',
    text:'Гарантия👌'
  }
]